In [1]:
import pandas as pd
series_mat = [[pd.Series([1,2,3,4]) for _ in range(2)] for _ in range(3)]
all_series = [s for sublist in series_mat for s in sublist]

In [5]:
df = pd.concat(all_series, axis=1)
df

   0  1  2  3  4  5
0  1  1  1  1  1  1
1  2  2  2  2  2  2
2  3  3  3  3  3  3
3  4  4  4  4  4  4

In [10]:
type(df.columns)

pandas.core.indexes.range.RangeIndex

In [6]:
def test(series,t,ceshi):
        return series[t]

In [7]:
for t in range(0,3):
    ceshi=0
    df[str(t)]=df.apply(test,axis=1,args=(t,ceshi))

In [8]:
df

   0  1  2  3  4  5  0  1  2
0  1  1  1  1  1  1  1  1  1
1  2  2  2  2  2  2  2  2  2
2  3  3  3  3  3  3  3  3  3
3  4  4  4  4  4  4  4  4  4

In [ ]:
df.loc[:,[t for t in range(-10,-8)]] = df.apply(test,axis=1)